{"config": [{"config": {"activity_regularizer": null, "subsample": [2, 2], "b_constraint": null, "nb_col": 5, "name": "convolution2d_1", "trainable": true, "input_dtype": "float32", "bias": true, "dim_ordering": "tf", "nb_filter": 32, "activation": "linear", "b_regularizer": null, "batch_input_shape": [null, 64, 64, 3], "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "nb_row": 5, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "elu_1", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "subsample": [1, 1], "b_constraint": null, "nb_col": 3, "name": "convolution2d_2", "trainable": true, "activation": "linear", "bias": true, "dim_ordering": "tf", "b_regularizer": null, "nb_filter": 16, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "valid", "nb_row": 3, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "elu_2", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.4}, "class_name": "Dropout"}, {"config": {"name": "maxpooling2d_1", "trainable": true, "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "subsample": [1, 1], "b_constraint": null, "nb_col": 3, "name": "convolution2d_3", "trainable": true, "activation": "linear", "bias": true, "dim_ordering": "tf", "b_regularizer": null, "nb_filter": 16, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "valid", "nb_row": 3, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "elu_3", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.4}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "b_constraint": null, "W_constraint": null, "name": "dense_1", "trainable": true, "input_dim": 2704, "bias": true, "activation": "linear", "b_regularizer": null, "output_dim": 1024, "init": "glorot_uniform", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "trainable": true, "p": 0.3}, "class_name": "Dropout"}, {"config": {"name": "elu_4", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "b_constraint": null, "W_constraint": null, "name": "dense_2", "trainable": true, "input_dim": 1024, "bias": true, "activation": "linear", "b_regularizer": null, "output_dim": 512, "init": "glorot_uniform", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "elu_5", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "b_constraint": null, "W_constraint": null, "name": "dense_3", "trainable": true, "input_dim": 512, "bias": true, "activation": "linear", "b_regularizer": null, "output_dim": 1, "init": "glorot_uniform", "W_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}